tests/jmeter/results/report_100/statistics.json
{
  "查询秒杀结果" : {
    "transaction" : "查询秒杀结果",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 2.6600000000000006,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 100.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 6.949999999999989,
    "pct3ResTime" : 39.90000000000009,
    "throughput" : 50.085144746068316,
    "receivedKBytesPerSec" : 13.254955299008314,
    "sentKBytesPerSec" : 9.331488530501852
  },
  "获取秒杀活动列表" : {
    "transaction" : "获取秒杀活动列表",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 35.40599999999997,
    "medianResTime" : 32.0,
    "minResTime" : 23.0,
    "maxResTime" : 100.0,
    "pct1ResTime" : 47.900000000000034,
    "pct2ResTime" : 57.94999999999999,
    "pct3ResTime" : 84.99000000000001,
    "throughput" : 50.215928492517826,
    "receivedKBytesPerSec" : 24.225262378226372,
    "sentKBytesPerSec" : 9.159699206588328
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1500,
    "errorCount" : 1000,
    "errorPct" : 66.666664,
    "meanResTime" : 13.744000000000014,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 111.0,
    "pct1ResTime" : 36.0,
    "pct2ResTime" : 44.0,
    "pct3ResTime" : 73.99000000000001,
    "throughput" : 148.61785395818885,
    "receivedKBytesPerSec" : 50.02306672941643,
    "sentKBytesPerSec" : 29.614042529475874
  },
  "参与秒杀" : {
    "transaction" : "参与秒杀",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 3.166,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 111.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 8.949999999999989,
    "pct3ResTime" : 54.8900000000001,
    "throughput" : 50.085144746068316,
    "receivedKBytesPerSec" : 13.15713275067615,
    "sentKBytesPerSec" : 11.473019758589603
  }
}