tests/jmeter/results/report_final_100/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 100,
    "errorCount" : 90,
    "errorPct" : 90.0,
    "meanResTime" : 835.52,
    "medianResTime" : 195.0,
    "minResTime" : 107.0,
    "maxResTime" : 6507.0,
    "pct1ResTime" : 3252.200000000016,
    "pct2ResTime" : 6305.549999999999,
    "pct3ResTime" : 6506.45,
    "throughput" : 15.108022359873091,
    "receivedKBytesPerSec" : 3.931921834869316,
    "sentKBytesPerSec" : 6.651808477489047
  },
  "参与秒杀" : {
    "transaction" : "参与秒杀",
    "sampleCount" : 100,
    "errorCount" : 90,
    "errorPct" : 90.0,
    "meanResTime" : 835.52,
    "medianResTime" : 195.0,
    "minResTime" : 107.0,
    "maxResTime" : 6507.0,
    "pct1ResTime" : 3252.200000000016,
    "pct2ResTime" : 6305.549999999999,
    "pct3ResTime" : 6506.45,
    "throughput" : 15.108022359873091,
    "receivedKBytesPerSec" : 3.931921834869316,
    "sentKBytesPerSec" : 6.651808477489047
  }
}